###################################################################

# Created by write_sdc on Thu May 22 00:18:46 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_wire_load_mode top
set_wire_load_model -name tsmc18_wl10 -library slow
set_max_area 0
set_load -pin_load 0.05 [get_ports {P[15]}]
set_load -pin_load 0.05 [get_ports {P[14]}]
set_load -pin_load 0.05 [get_ports {P[13]}]
set_load -pin_load 0.05 [get_ports {P[12]}]
set_load -pin_load 0.05 [get_ports {P[11]}]
set_load -pin_load 0.05 [get_ports {P[10]}]
set_load -pin_load 0.05 [get_ports {P[9]}]
set_load -pin_load 0.05 [get_ports {P[8]}]
set_load -pin_load 0.05 [get_ports {P[7]}]
set_load -pin_load 0.05 [get_ports {P[6]}]
set_load -pin_load 0.05 [get_ports {P[5]}]
set_load -pin_load 0.05 [get_ports {P[4]}]
set_load -pin_load 0.05 [get_ports {P[3]}]
set_load -pin_load 0.05 [get_ports {P[2]}]
set_load -pin_load 0.05 [get_ports {P[1]}]
set_load -pin_load 0.05 [get_ports {P[0]}]
set_max_capacitance 0.15 [get_ports {X[7]}]
set_max_capacitance 0.15 [get_ports {X[6]}]
set_max_capacitance 0.15 [get_ports {X[5]}]
set_max_capacitance 0.15 [get_ports {X[4]}]
set_max_capacitance 0.15 [get_ports {X[3]}]
set_max_capacitance 0.15 [get_ports {X[2]}]
set_max_capacitance 0.15 [get_ports {X[1]}]
set_max_capacitance 0.15 [get_ports {X[0]}]
set_max_capacitance 0.15 [get_ports {Y[7]}]
set_max_capacitance 0.15 [get_ports {Y[6]}]
set_max_capacitance 0.15 [get_ports {Y[5]}]
set_max_capacitance 0.15 [get_ports {Y[4]}]
set_max_capacitance 0.15 [get_ports {Y[3]}]
set_max_capacitance 0.15 [get_ports {Y[2]}]
set_max_capacitance 0.15 [get_ports {Y[1]}]
set_max_capacitance 0.15 [get_ports {Y[0]}]
set_max_fanout 20 [get_ports {X[7]}]
set_max_fanout 20 [get_ports {X[6]}]
set_max_fanout 20 [get_ports {X[5]}]
set_max_fanout 20 [get_ports {X[4]}]
set_max_fanout 20 [get_ports {X[3]}]
set_max_fanout 20 [get_ports {X[2]}]
set_max_fanout 20 [get_ports {X[1]}]
set_max_fanout 20 [get_ports {X[0]}]
set_max_fanout 20 [get_ports {Y[7]}]
set_max_fanout 20 [get_ports {Y[6]}]
set_max_fanout 20 [get_ports {Y[5]}]
set_max_fanout 20 [get_ports {Y[4]}]
set_max_fanout 20 [get_ports {Y[3]}]
set_max_fanout 20 [get_ports {Y[2]}]
set_max_fanout 20 [get_ports {Y[1]}]
set_max_fanout 20 [get_ports {Y[0]}]
set_max_transition 3 [get_ports {X[7]}]
set_max_transition 3 [get_ports {X[6]}]
set_max_transition 3 [get_ports {X[5]}]
set_max_transition 3 [get_ports {X[4]}]
set_max_transition 3 [get_ports {X[3]}]
set_max_transition 3 [get_ports {X[2]}]
set_max_transition 3 [get_ports {X[1]}]
set_max_transition 3 [get_ports {X[0]}]
set_max_transition 3 [get_ports {Y[7]}]
set_max_transition 3 [get_ports {Y[6]}]
set_max_transition 3 [get_ports {Y[5]}]
set_max_transition 3 [get_ports {Y[4]}]
set_max_transition 3 [get_ports {Y[3]}]
set_max_transition 3 [get_ports {Y[2]}]
set_max_transition 3 [get_ports {Y[1]}]
set_max_transition 3 [get_ports {Y[0]}]
set_drive 1  [get_ports {X[7]}]
set_drive 1  [get_ports {X[6]}]
set_drive 1  [get_ports {X[5]}]
set_drive 1  [get_ports {X[4]}]
set_drive 1  [get_ports {X[3]}]
set_drive 1  [get_ports {X[2]}]
set_drive 1  [get_ports {X[1]}]
set_drive 1  [get_ports {X[0]}]
set_drive 1  [get_ports {Y[7]}]
set_drive 1  [get_ports {Y[6]}]
set_drive 1  [get_ports {Y[5]}]
set_drive 1  [get_ports {Y[4]}]
set_drive 1  [get_ports {Y[3]}]
set_drive 1  [get_ports {Y[2]}]
set_drive 1  [get_ports {Y[1]}]
set_drive 1  [get_ports {Y[0]}]
