###################################################################

# Created by write_sdc on Wed Jun 11 03:46:48 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_wire_load_mode top
set_wire_load_model -name tsmc18_wl10 -library slow
set_max_area 0
set_load -pin_load 0.05 [get_ports vld]
set_load -pin_load 0.05 [get_ports {a2_latch[8]}]
set_load -pin_load 0.05 [get_ports {a2_latch[7]}]
set_load -pin_load 0.05 [get_ports {a2_latch[6]}]
set_load -pin_load 0.05 [get_ports {a2_latch[5]}]
set_load -pin_load 0.05 [get_ports {a2_latch[4]}]
set_load -pin_load 0.05 [get_ports {a2_latch[3]}]
set_load -pin_load 0.05 [get_ports {a2_latch[2]}]
set_load -pin_load 0.05 [get_ports {a2_latch[1]}]
set_load -pin_load 0.05 [get_ports {a2_latch[0]}]
set_max_capacitance 0.15 [get_ports clk]
set_max_capacitance 0.15 [get_ports rstn]
set_max_capacitance 0.15 [get_ports trig]
set_max_capacitance 0.15 [get_ports {tanha[8]}]
set_max_capacitance 0.15 [get_ports {tanha[7]}]
set_max_capacitance 0.15 [get_ports {tanha[6]}]
set_max_capacitance 0.15 [get_ports {tanha[5]}]
set_max_capacitance 0.15 [get_ports {tanha[4]}]
set_max_capacitance 0.15 [get_ports {tanha[3]}]
set_max_capacitance 0.15 [get_ports {tanha[2]}]
set_max_capacitance 0.15 [get_ports {tanha[1]}]
set_max_capacitance 0.15 [get_ports {tanha[0]}]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports rstn]
set_max_fanout 20 [get_ports trig]
set_max_fanout 20 [get_ports {tanha[8]}]
set_max_fanout 20 [get_ports {tanha[7]}]
set_max_fanout 20 [get_ports {tanha[6]}]
set_max_fanout 20 [get_ports {tanha[5]}]
set_max_fanout 20 [get_ports {tanha[4]}]
set_max_fanout 20 [get_ports {tanha[3]}]
set_max_fanout 20 [get_ports {tanha[2]}]
set_max_fanout 20 [get_ports {tanha[1]}]
set_max_fanout 20 [get_ports {tanha[0]}]
set_max_transition 3 [get_ports clk]
set_max_transition 3 [get_ports rstn]
set_max_transition 3 [get_ports trig]
set_max_transition 3 [get_ports {tanha[8]}]
set_max_transition 3 [get_ports {tanha[7]}]
set_max_transition 3 [get_ports {tanha[6]}]
set_max_transition 3 [get_ports {tanha[5]}]
set_max_transition 3 [get_ports {tanha[4]}]
set_max_transition 3 [get_ports {tanha[3]}]
set_max_transition 3 [get_ports {tanha[2]}]
set_max_transition 3 [get_ports {tanha[1]}]
set_max_transition 3 [get_ports {tanha[0]}]
set_ideal_network -no_propagate  [get_ports clk]
create_clock [get_ports clk]  -period 15  -waveform {0 7.5}
set_clock_latency 1  [get_clocks clk]
set_clock_latency -source 0  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  -max 7.5  [get_ports clk]
set_input_delay -clock clk  -min 0  [get_ports clk]
set_input_delay -clock clk  -max 7.5  [get_ports rstn]
set_input_delay -clock clk  -min 0  [get_ports rstn]
set_input_delay -clock clk  -max 7.5  [get_ports trig]
set_input_delay -clock clk  -min 0  [get_ports trig]
set_input_delay -clock clk  -max 7.5  [get_ports {tanha[8]}]
set_input_delay -clock clk  -min 0  [get_ports {tanha[8]}]
set_input_delay -clock clk  -max 7.5  [get_ports {tanha[7]}]
set_input_delay -clock clk  -min 0  [get_ports {tanha[7]}]
set_input_delay -clock clk  -max 7.5  [get_ports {tanha[6]}]
set_input_delay -clock clk  -min 0  [get_ports {tanha[6]}]
set_input_delay -clock clk  -max 7.5  [get_ports {tanha[5]}]
set_input_delay -clock clk  -min 0  [get_ports {tanha[5]}]
set_input_delay -clock clk  -max 7.5  [get_ports {tanha[4]}]
set_input_delay -clock clk  -min 0  [get_ports {tanha[4]}]
set_input_delay -clock clk  -max 7.5  [get_ports {tanha[3]}]
set_input_delay -clock clk  -min 0  [get_ports {tanha[3]}]
set_input_delay -clock clk  -max 7.5  [get_ports {tanha[2]}]
set_input_delay -clock clk  -min 0  [get_ports {tanha[2]}]
set_input_delay -clock clk  -max 7.5  [get_ports {tanha[1]}]
set_input_delay -clock clk  -min 0  [get_ports {tanha[1]}]
set_input_delay -clock clk  -max 7.5  [get_ports {tanha[0]}]
set_input_delay -clock clk  -min 0  [get_ports {tanha[0]}]
set_output_delay -clock clk  -max 7.5  [get_ports vld]
set_output_delay -clock clk  -min 0  [get_ports vld]
set_output_delay -clock clk  -max 7.5  [get_ports {a2_latch[8]}]
set_output_delay -clock clk  -min 0  [get_ports {a2_latch[8]}]
set_output_delay -clock clk  -max 7.5  [get_ports {a2_latch[7]}]
set_output_delay -clock clk  -min 0  [get_ports {a2_latch[7]}]
set_output_delay -clock clk  -max 7.5  [get_ports {a2_latch[6]}]
set_output_delay -clock clk  -min 0  [get_ports {a2_latch[6]}]
set_output_delay -clock clk  -max 7.5  [get_ports {a2_latch[5]}]
set_output_delay -clock clk  -min 0  [get_ports {a2_latch[5]}]
set_output_delay -clock clk  -max 7.5  [get_ports {a2_latch[4]}]
set_output_delay -clock clk  -min 0  [get_ports {a2_latch[4]}]
set_output_delay -clock clk  -max 7.5  [get_ports {a2_latch[3]}]
set_output_delay -clock clk  -min 0  [get_ports {a2_latch[3]}]
set_output_delay -clock clk  -max 7.5  [get_ports {a2_latch[2]}]
set_output_delay -clock clk  -min 0  [get_ports {a2_latch[2]}]
set_output_delay -clock clk  -max 7.5  [get_ports {a2_latch[1]}]
set_output_delay -clock clk  -min 0  [get_ports {a2_latch[1]}]
set_output_delay -clock clk  -max 7.5  [get_ports {a2_latch[0]}]
set_output_delay -clock clk  -min 0  [get_ports {a2_latch[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports rstn]
set_drive 1  [get_ports trig]
set_drive 1  [get_ports {tanha[8]}]
set_drive 1  [get_ports {tanha[7]}]
set_drive 1  [get_ports {tanha[6]}]
set_drive 1  [get_ports {tanha[5]}]
set_drive 1  [get_ports {tanha[4]}]
set_drive 1  [get_ports {tanha[3]}]
set_drive 1  [get_ports {tanha[2]}]
set_drive 1  [get_ports {tanha[1]}]
set_drive 1  [get_ports {tanha[0]}]
